[toc]

# Урок 4. Словари, множества и профилирование

## Задача 22: 

Даны два неупорядоченных набора целых чисел (может быть, с повторениями). 

Выдать без повторений в порядке возрастания все те числа, которые встречаются в обоих наборах. 

Пользователь вводит 2 числа. 

- `n` - кол-во элементов первого множества. 
- `m` - кол-во элементов второго множества. 

Затем пользователь вводит сами элементы множеств.

```
11 6
2 4 6 8 10 12 10 8 6 4 2
3 6 9 12 15 18

6 12
```

### Решение:

```python
n, m = map(int, input().split())

list_n = list(map(int, input().split()))[:n]
list_m = list(map(int, input().split()))[:m]

i = 0
while i < n - 1:
  if list_n[i] in list_n[i + 1:]:
    list_n.pop(i)
    n -= 1
  else:
    i += 1

i = 0
while i < m:
  if list_m[i] not in list_n:
    list_m.pop(i)
    m -= 1
  else:
    i += 1

print(*sorted(list_m))
```

## Задача 23:

Дан массив, состоящий из целых чисел.

Напишите программу, которая подсчитает количество элементов массива, больших предыдущего (элемента с предыдущим номером)

```
Input: [0, -1, 5, 2, 3]
Output: 2 (-1 < 5, 2 < 3)
```

### Решение:

```python
list = [0, -1, 5, 2, 3]

count = 0
i = 0
while i < len(list) - 1:
  if list[i] < list[i + 1]:
    count += 1
  i += 1

print(count)
```

## Задача 24: 

В фермерском хозяйстве в Карелии выращивают чернику. Она растет на круглой грядке, причем кусты высажены только по окружности. Таким образом, у каждого куста есть ровно два соседних. Всего на грядке растет N кустов. Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них выросло различное число ягод – на i-ом кусте выросло ai ягод. В этом фермерском хозяйстве внедрена система автоматического сбора черники. Эта система состоит из управляющего модуля и нескольких собирающих модулей. Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом, собирает ягоды с этого куста и с двух соседних с ним. Напишите программу для нахождения максимального числа ягод, которое может собрать за один заход собирающий модуль, находясь перед некоторым кустом заданной во входном файле грядки.

```
4 -> 1 2 3 4
9
```

### Решение:

```python

```

## Задача 25:

Напишите программу, которая принимает на вход строку, и отслеживает, сколько раз каждый символ уже встречался. Количество повторов добавляется к символам с помощью постфикса формата _n.

- Input: a a a b c a a d c d d 
- Output: a a_1 a_2 b c a_3 a_4 d c_1 d_1 d_2

> Для решения данной задачи используйте функцию .split()

### Решение:

```python

```

## Задача 27:

Пользователь вводит текст(строка). Словом считается последовательность непробельных символов идущих подряд, слова разделены одним или большим числом пробелов. Определите, сколько различных слов содержится в этом тексте.

- Input: She sells sea shells on the sea shore The shells that she sells are sea shells I'm sure.So if she sells sea shells on the sea shore I'm sure that the shells are sea shore shells 
- Output: 13

### Решение:

```python

```

## Задача 29:

Ваня и Петя поспорили, кто быстрее решит следующую задачу: “Задана последовательность неотрицательных целых чисел. Требуется определить значение наибольшего элемента последовательности, которая завершается первым встретившимся нулем (число 0 не входит в последовательность)”. Однако 2 друга оказались не такими смышлеными. Никто из ребят не смог до конца сделать это задание. Они решили так: у кого будет меньше ошибок в коде, тот и выиграл спор. За помощью товарищи обратились к Вам, студентам. 

> Примечание: Программные коды на следующих слайдах 30 минут 

### Решение:

```python

```



## 





