# C# - Урок 3. Базовые алгоритмы. Продолжение

## Задача 19: Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.

```
14212 -> нет
12821 -> да
23432 -> да
```

### Решение:

```c#
    int n = Convert.ToInt32(Console.ReadLine());

    int t = n;
    int p = 0;
    while (n > 0)
    {
      int x = n % 10;

      n /= 10;

      p = p * 10 + x;
    }

    Console.WriteLine(t == p ? "да" : "нет");
```