# Python - Знакомство с языком Python

# Урок 1. Ввод-Вывод, операторы ветвления

## _Задача 1_: Сумма цифр трехзначного числа

Найдите сумму цифр трехзначного числа n.

Результат сохраните в перменную res.

Пример:

```
n = 123 -> res = 6 (1 + 2 + 3)

n = 100 -> res = 1 (1 + 0 + 0)
```

### Решение:

```python
n = 123

a = ((n - (n % 100)) / 100) % 100
b = ((n - (n % 10)) / 10) % 10
c = n % 10

res = int(a + b + c)
```

## _Задача 2_: Бумажные журавлики

Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали `n` журавликов.

Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов, а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

Выведите через пробел количество журавликов, сделанных Петей, Катей и Сережей.

**Пример:**

```
n = 6 -> 1 4 1  
n = 24 -> 4 16 4    
n = 60 -> 10 40 10 
```

### Решение:

```python
n = 6

x = int(n / 3)
b = n - x
a, c = int(x / 2), int(x / 2)

print(f"{a} {b} {c}")
```

## _Задача 3_: Счастливый билет

Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд и получали билет с номером.

Счастливым билетом называют такой билет с шестизначным номером, где сумма первых трех цифр равна сумме последних трех.

Т.е. билет с номером `385916` – счастливый, т.к. `3+8+5=9+1+6`.

Вам требуется написать программу, которая проверяет счастливость билета с номером `n` и выводит на экран `yes` или `no`.

**Пример:**

```
n = 385916 -> yes
n = 123456 -> no
```

### Решение:

```python
n = 385916

a = int(n / 1000) 
b = n % 1000

i = 0
while a > 0:
  i = i + (a % 10)
  a = int(a / 10)

j = 0
while b > 0:
  j = j + (b % 10)
  b = int(b / 10)

print("yes" if i == j else "no")
```

## _Задача 4_: Деление шоколадки

Определите, можно ли от шоколадки размером `a × b` долек отломить `c` долек, если разрешается сделать один разлом по прямой между дольками (то есть разломить шоколадку на два прямоугольника).

Выведите `yes` или `no` соответственно.

**Пример:**

```
a, b, c = 3, 2, 4 -> yes
a, b, c = 3, 2, 1 -> no
```

### Решение:

```python
a = 3
b = 2
c = 4

print("yes" if c % a == 0 or c % b == 0 else "no")
```
