[toc]

# Урок 1. Ввод-Вывод, операторы ветвления

## Задача **1**:

За день машина проезжает `n` километров. Сколько дней нужно, чтобы проехать маршрут длиной `m` километров? 

При решении этой задачи нельзя пользоваться условной инструкцией `if` и циклами. 

- Input: 
  - n = 700 
  - m = 750 
- Output: 2

### Решение:

```python
from math import ceil

n, m = map(int, input().split())

print(ceil(m / n))
```

## Задача **2**: 

Найдите сумму цифр трехзначного числа.

```
123 -> 6 (1 + 2 + 3)
100 -> 1 (1 + 0 + 0)
```

### Решение:

```python
n = 123

i = 0
while n > 0:
  i += n % 10
  n = int(n / 10)

print(i)
```

## Задача **3**:

В некоторой школе решили набрать 3 новых математических класса и оборудовать кабинеты для них новыми партами. За каждой партой может сидеть 2 учащихся. Известно количество учащихся в каждом из 3-х классов. 

Выведите наименьшее число парт, которое нужно приобрести для них. 

- Input: 20 21 22 (ввод чисел НЕ в одну строку) 
- Output: 32

### Решение:

```python
from math import ceil

a = int(input())
b = int(input())
c = int(input())

print(ceil((a + b + c) / 2))
```

## Задача **4**: 

Петя, Катя и Сережа делают из бумаги журавликов. 

Вместе они сделали `S` журавликов. Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов, а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

```
6 -> 1 4 1
24 -> 4 16 4
60 -> 10 40 10
```

### Решение:

```python
n = 6

a = int(n / 3)
b = int(n - a)

print(int(a / 2), b, int(a / 2))
```

## Задача **5**:

Вагоны в электричке пронумерованы натуральными числами, начиная с 1 (при этом иногда вагоны нумеруются от «головы» поезда, а иногда – с «хвоста»; это зависит от того, в какую сторону едет электричка). В каждом вагоне написан его номер. 

- Витя сел в `i`-й вагон от головы поезда и обнаружил, что его вагон имеет номер `j`. Он хочет определить, сколько всего вагонов в электричке. 
- Напишите программу, которая будет это делать или сообщать, что без дополнительной информации это сделать невозможно. 

Input: 3 4(ввод на разных строках) 

Output: 6

### Решение:

```python
i = int(input())
j = int(input())

print(i + j -1)
```

## Задача **6**: 

Вы пользуетесь общественным транспортом? 

Вероятно, вы расплачивались за проезд и получали билет с номером. Счастливым билетом называют такой билет с шестизначным номером, где сумма первых трех цифр равна сумме последних трех. 

Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6. 

Вам требуется написать программу, которая проверяет счастливость билета.

```
385916 -> yes
123456 -> no
```

### Решение:

```python
n = 385916

x = str(n)
s = int(len(x) / 2)

l = x[:s]
r = x[s:]

a = 0
for i in l:
  a += int(i)

b = 0
for i in r:
  b += int(i)

print(('no','yes')[a == b])
```

## Задача **7**:

Дано натуральное число. Требуется определить, является ли год с данным номером високосным. Если год является високосным, то выведите YES, иначе выведите NO. 

> Напомним, что в соответствии с григорианским календарем, год является високосным, если его номер кратен 4, но не кратен 100, а также если он кратен 400. 

- Input: 2016 
- Output: YES

### Решение:

```python
n = 2016

print(n % 4 == 0 and n % 100 and n % 400 != 0)
```

## Задача **8**: 

Требуется определить, можно ли от шоколадки размером n × m долек отломить k долек, если разрешается сделать один разлом по прямой между дольками (то есть разломить шоколадку на два прямоугольника).

```
3 2 4 -> yes
3 2 1 -> no
```

### Решение:

```python
x, y, n = map(int, input().split())

print(n % x == 0 or n % 2 == 0)
```

# Урок 2. Циклы (for, while)

## Задача **9**:

По данному целому неотрицательному `n` вычислите значение `n!`. 

`N! = 1 * 2 * 3 * … * N` (произведение всех чисел от 1 до N) `0! = 1` Решить задачу используя цикл while

- Input: 5
- Output: 120

### Решение:

```python
n = 5

f = 1
i = 1
while i < n:
  i += 1
  f *= i

print(f)
```

## Задача **10**:

На столе лежат `n` монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом. 

Определите минимальное число монеток, которые нужно перевернуть, чтобы все монетки были повернуты вверх одной и той же стороной. 

Выведите минимальное количество монет, которые нужно перевернуть

```
5 -> 1 0 1 1 0
2
```

### Решение:

Создаем рандомный список:

```python
import random

c = 5
coins = list()

i = 0
while i < c:
  i += 1
  coins.append(random.randint(0, 1))
```

Решение 1:

```python
res = 0
for i in coins:
  if i == 0:
    res += 1

print(f"{c} -> {coins} \n{res}")
```

Решение 2:

```python
s = ''.join(str(coins))
res = s.count('0')

print(f"{c} -> {coins} \n{res}")
```

## Задача **11**:

Дано натуральное число `A > 1`. 

Определите, каким по счету числом Фибоначчи оно является, то есть выведите такое число `n`, что `φ(n)=A`. 

Если `А` не является числом Фибоначчи, выведите число `-1`.

- Input: 5
- Output: 6

### Решение:

```python
a = 21

n = 0

f1 = 1
f2 = 1
while f1 < a - 1 > 0:
  f1, f2 = f2, f1 + f2
  a -= 1 
  n += 1

print(n + 2)
```

## Задача **12**:

Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. 

- Петя помогает Кате по математике. Он задумывает два натуральных числа `X` и `Y` `(X,Y≤1000)`, а Катя должна их отгадать. Для этого Петя делает две подсказки. 
- Он называет сумму этих чисел `S` и их произведение `P`. Помогите Кате отгадать задуманные Петей числа.

```
4 4 -> 2 2
5 6 -> 2 3
```

### Решение:

```python
s, p = map(int, input().split())

y = 0

i = 1
while i < s:
  if p % i == 0:
    y = i
  i += 1

x = s - y
  
print(x, y)
```

## Задача **13**:

Уставшие от необычно теплой зимы, жители решили узнать, действительно ли это самая длинная оттепель за всю историю наблюдений за погодой. Они обратились к синоптикам, а те, в свою очередь, занялись исследованиями статистики за прошлые годы. 

Их интересует, сколько дней длилась самая длинная оттепель. Оттепелью они называют период, в который среднесуточная температура ежедневно превышала `0` градусов Цельсия. 

Напишите программу, помогающую синоптикам в работе.

- Пользователь вводит число `N` – общее количество рассматриваемых дней (`1 ≤ N ≤ 100`). В следующих строках располагается `N` целых чисел.
- Каждое число – среднесуточная температура в соответствующий день. 
- Температуры – целые числа и лежат в диапазоне от –50 до 50

```
Input: 6 -> -20 30 -40 50 10 -10
Output: 2
```

### Решение:

```python
import random

n = int(input())

l = list()
i = n
while i > 0:
  l.append(random.randint(-50, 50))
  i -= 1

max = 0
cnt = 0
i = 0
while i < n:
  if l[i] > 0:
    cnt += 1
  else:
    if cnt > max:
      max = cnt
    cnt = 0
  
  i += 1

print(f"{n} -> {l} \n{max}")
```

## Задача **14**:

Требуется вывести все целые степени двойки (т.е. числа вида 2k), не превосходящие числа `N`.

```python
10 -> 1 2 4 8
```

### Решение:

```python
n = int(input())

i = 1
while i < n:
  print(i)
  i *= 2
```

## Задача **15**:

Иван Васильевич пришел на рынок и решил купить два арбуза: один для себя, а другой для тещи.
Понятно, что для себя нужно выбрать арбуз потяжелей, а для тещи полегче. Но вот незадача:
арбузов слишком много и он не знает как же выбрать самый легкий и самый тяжелый арбуз? Помогите ему!

- Пользователь вводит одно число `N` – количество арбузов. 
- Вторая строка содержит `N` чисел, записанных на новой строчке каждое. Здесь каждое число – это масса соответствующего арбуза

- Input:5 -> 5 1 6 5 9
- Output: 1 9

### Решение:

```python
import random

n = int(input())

l = list()

i = 0
while i < n:
  l.append(random.randint(1, 20))
  i += 1

min = l[0] 
max = l[1]

i = 0
while i < n:
  if l[i] > max:
    max = l[i]
  else:
    if min > l[i]:
      min = l[i]
  i += 1

print(f"{n} -> {l}\n{min} {max}")
```
