[toc]

# Урок 3. Списки и словари

## Задача 16: 

Требуется вычислить, сколько раз встречается некоторое число `X` в массиве `A[1..N]`. Пользователь в первой строке вводит натуральное число `N` – количество элементов в массиве. 

- В последующих строках записаны `N` целых чисел `A_i`. 
- Последняя строка содержит число `X`

```
5
1 2 3 4 5
3
-> 1
```

### Решение:

```python
list_1 = [2, 4, 1, 6, 8, 2, 9, 3, 2, 5]

k = 2

count = 0

for i in list_1:
  count += (0, 1)[k % i != k and i >= k]

print(count)
```

## Задача 17:


Дан список чисел. Определите, сколько в нем встречается различных чисел.

- Input: [1, 1, 2, 0, -1, 3, 4, 4]
- Output: 6

### Решение:

```python
list_1 = [1, 1, 2, 0, -1, 3, 4, 4]

lsit_2 = []

for i in list_1:
  if i not in lsit_2:
    lsit_2.append(i)
  else:
    continue

print(len(lsit_2))
```

## Задача 18: 

Требуется найти в массиве `A[1..N]` самый близкий по величине элемент к заданному числу `X`. 

> - Пользователь в первой строке вводит натуральное число `N` – количество элементов в массиве. 
> - В последующих строках записаны `N` целых чисел `A_i`. 
> - Последняя строка содержит число `X`

```
5
1 2 3 4 5
6
-> 5
```

### Решение:

```python
list_1 = [2, 4, 1, 6, 8, 2, 9, 3, 2, 5]
k = 10

a = list_1[0]
b = list_1[len(list_1)-1]

for i in list_1:
  if k >= i > a:
    a = i
  elif k < i < b:
    b = i 

print((a, b)[abs(k - a) > abs(b - k)])
```

## Задача 19:

Дана последовательность из `N` целых чисел и число `K`. 

Необходимо сдвинуть всю последовательность (сдвиг - циклический) на `K ` элементов вправо, `K` – положительное число.

```
Input: [1, 2, 3, 4, 5

k = 3

Output: [4, 5, 1, 2, 3]
```

### Решение:

```python
list = [1, 2, 3, 4, 5]
k = 3

for i in range(k - 1):
  list.insert(0, list.pop())

  print(list)
```

## Задача 20: 

В настольной игре Скрабл (Scrabble) каждая буква имеет определенную ценность. 

В случае с английским алфавитом очки распределяются так:

- A, E, I, O, U, L, N, S, T, R – 1 очко;
- D, G – 2 очка;
- B, C, M, P – 3 очка;
- F, H, V, W, Y – 4 очка;
- K – 5 очков;
- J, X – 8 очков;
- Q, Z – 10 очков.

А русские буквы оцениваются так:

- А, В, Е, И, Н, О, Р, С, Т – 1 очко;
- Д, К, Л, М, П, У – 2 очка;
- Б, Г, Ё, Ь, Я – 3 очка;
- Й, Ы – 4 очка;
- Ж, З, Х, Ц, Ч – 5 очков;
- Ш, Э, Ю – 8 очков;
- Ф, Щ, Ъ – 10 очков.

Напишите программу, которая вычисляет стоимость введенного пользователем слова.
Будем считать, что на вход подается только одно слово, которое содержит либо только английские, либо только русские буквы.

```
Ввод: ноутбук
Вывод: 12
```

### Решение:

```python
one = ['A', 'E', 'I', 'O', 'U', 'L', 'N', 'S', 'T', 'R', 'А', 'В', 'Е', 'И', 'Н', 'О', 'Р', 'С', 'Т']
two = ['D', 'G', 'Д', 'К', 'Л', 'М', 'П', 'У']
three = ['B', 'C', 'M', 'P', 'Б', 'Г', 'Ё', 'Ь', 'Я']
fore = ['F', 'H', 'V', 'W', 'Y', 'Й', 'Ы']
five = ['K', 'Ж', 'З', 'Х', 'Ц', 'Ч']
eight = ['J', 'X','Ш', 'Э', 'Ю']
ten = ['Q', 'Z', 'Ф', 'Щ', 'Ъ']

k = 'ноутбук'

cost = 0

for i in k:
  if i.capitalize() in one:
    cost += 1    
  elif i.capitalize() in two:
    cost += 2
  elif i.capitalize() in three:
    cost += 3
  elif i.capitalize() in fore:
    cost += 4
  elif i.capitalize() in five:
    cost += 5
  elif i.capitalize() in eight:
    cost += 8
  elif i.capitalize() in ten:
    cost += 10

print(cost)
```

Решенеие 2:

```python
points_en = {
  1: 'AEIOULNSTR', 
  2: 'DG', 
  3: 'BCMP', 
  4: 'FHVWY', 
  5: 'K', 
  8: 'JX', 
  10: 'QZ'
}

points_ru = {
  1: 'АВЕИНОРСТ', 
  2: 'ДКЛМПУ', 
  3: 'БГЁЬЯ',
  4: 'ЙЫ', 
  5: 'ЖЗХЦЧ', 
  8: 'ШЭЮ', 
  10: 'ФЩЪ'
}

word = k.upper()  # переводим все буквы в верхний регистр

count = 0
for i in word:
    if i in 'QWERTYUIOPASDFGHJKLZXCVBNM':
        for j in points_en:
            if i in points_en[j]:
                count = count + j
    else:
        for j in points_en:
            if i in points_ru[j]:
                count = count + j
print(count)
```



## Задача 21:

Напишите программу для печати всех уникальных значений в словаре.

```
Input: [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"}, {"VII": " S005 "}, {" V ":" S009 "}, {" VIII ":" S007 "}]

Output: {'S005', 'S002', 'S007', 'S001', 'S009'}
```

### Решение:

```python
dic = {"V": "S001", "V": "S002", "VI": "S001", "VI": "S005", "VII": "S005", "V":"S009", "VIII ":"S007"}

dic_unique = {}

for i in dic:
  if i not in dic_unique:
    dic_unique[i] = dic[i]
    print(dic_unique[i])
```

## Задача 23:

Дан массив, состоящий из целых чисел. Напишите программу, которая подсчитает количество
элементов массива, больших предыдущего (элемента с предыдущим номером)

- Input: [0, -1, 5, 2, 3]
- Output: 2 (-1 < 5, 2 < 3)

### Решение:

```python
```

